Cannot have nested loops.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NestedLoops { get; }
  Visual Basic
Public Shared ReadOnly Property NestedLoops As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NestedLoops {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace